---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarPresentationMode.Middle
enum: Autodesk.Revit.DB.Structure.RebarPresentationMode
source: html/84cfa6b2-460d-9d32-1f6a-55dbbfece098.htm
---
# Autodesk.Revit.DB.Structure.RebarPresentationMode.Middle

The middle bar is presented.